In [ ]:
#Try bring in the csv file here

In [ ]:
import pandas as pd

df = pd.read_csv("City Temperature without row numbers.csv")
df

   Unnamed: 0          City  temp10  temp11  empty_temp  mel_temp
0           0  Kuala Lumpur      32      32         NaN         5
1           1       Banting      29      30         NaN         4
2           2         Klang      31      31         NaN         1
3           3     Shah Alam      30      29         NaN         5
4           4     Damansara      28      30         NaN         2

In [3]:

df2 = pd.read_csv("City Temperature without row numbers.csv")
df2

           City  temp10  temp11  empty_temp  mel_temp
0  Kuala Lumpur      32      32         NaN         5
1       Banting      29      30         NaN         4
2         Klang      31      31         NaN         1
3     Shah Alam      30      29         NaN         5
4     Damansara      28      30         NaN         2